Revit 2027 API
BuiltInFailures.EditingFailures.BorrowElementsAtRisk Property
 Can't obtain permission to edit the element: The Central Model is inaccessible. You can check out worksets at risk, but consider carefully!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BorrowElementsAtRisk { get; }
Public Shared ReadOnly Property BorrowElementsAtRisk As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BorrowElementsAtRisk {
	FailureDefinitionId^ get ();
}
static member BorrowElementsAtRisk : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace